export default {
  values: [
    {
      name: "HTML",
      descr:
        "HTML (Hypertext Markup Language) - это стандартный язык разметки, используемый для создания веб-страниц и веб-приложений. HTML состоит из серии элементов, представленных тегами, которые определяют структуру и содержание веб-страницы.",
      url: require("@/assets/icons/html.png"),
    },
    {
      name: "CSS",
      descr:
        "CSS (Cascading Style Sheets) - это язык оформления, используемый для описания внешнего вида документа, написанного на HTML или XML. CSS позволяет управлять цветом, шрифтом, расстоянием между элементами и многим другим, что позволяет разделить содержимое и оформление веб-страницы.",
      url: require("@/assets/icons/css2.png"),
    },
    {
      name: "js",
      descr:
        "JavaScript - это программный язык, который используется для реализации интерактивных и динамических функций на веб-страницах. JavaScript позволяет создавать эффекты анимации, валидировать формы на стороне клиента, создавать диалоговые окна и многое другое.",
      url: require("@/assets/icons/js.png"),
    },
    {
      name: "React",
      descr:
        "React - это JavaScript-библиотека, разработанная Facebook, для создания пользовательских интерфейсов. React использует реактивный подход, который позволяет быстро и эффективно обновлять данные в пользовательском интерфейсе при изменении данных в приложении.",
      url: require("@/assets/icons/react.png"),
    },
    {
      name: "Angular",
      descr:
        "Angular - это популярный JavaScript-фреймворк, разработанный Google, для создания веб-приложений. Angular предлагает широкий набор инструментов для управления данными, роутингом, шаблонами и многим другим, что позволяет ускорить разработку и улучшить поддерживаемость кода.",
      url: require("@/assets/icons/angular.png"),
    },
    {
      name: "Vue",
      descr:
        "Vue 3 представляет современный прогрессивный фреймворк, написанный на языке TypeScript и предназначенный для создания веб-приложений на уровне клиента. Основная область применения данного фреймворка - это создание и организация пользовательского интерфейса.",
      url: require("@/assets/icons/vue2.png"),
    },
    {
      name: "python",
      descr:
        "Python - это высокоуровневый язык программирования с открытым исходным кодом, который прославлен своей простотой и читаемостью кода. Python поддерживает множество различных приложений, включая веб-разработку, научные вычисления, анализ данных и машинное обучение.",
      url: require("@/assets/icons/python.png"),
    },
    {
      name: "php",
      descr:
        "PHP (Hypertext Preprocessor) - это язык программирования для серверной части веб-приложений, который поддерживает динамическую генерацию веб-страниц. PHP является одним из самых популярных языков для веб-разработки, поскольку он легок в использовании и имеет богатую экосистему библиотек и расширений.",
      url: require("@/assets/icons/php.png"),
    },
    {
      name: "typescript",
      descr:
        "TypeScript - это язык программирования, который является суперсетом JavaScript и добавляет поддержку типов данных и других функций, которые повышают стабильность и производительность кода. TypeScript компилируется в JavaScript, что позволяет работать с большинством существующих библиотек и фреймворков.",
      url: require("@/assets/icons/ts.png"),
    },
    {
      name: "redux",
      descr:
        "Redux - это популярная библиотека JavaScript для управления состоянием приложения. Она предлагает простой и эффективный способ управления данными и состоянием в многокомпонентных приложениях. Redux основан на паттерне Flux и используется в комбинации с фреймворками, такими как React и Angular.",
      url: require("@/assets/icons/redux.png"),
    },
    {
      name: "next",
      descr:
        "Next.js - это фреймворк для React, который предоставляет удобный инструментарий для создания производительных и эффективных веб-приложений. Next.js оптимизирует код на стороне сервера и клиента, что повышает скорость загрузки и отображения страниц.",
      url: require("@/assets/icons/next.png"),
    },
    {
      name: "node",
      descr:
        "Node.js - это платформа на основе JavaScript, которая позволяет создавать серверные приложения используя JavaScript. Node.js использует движок V8 JavaScript, разработанный Google, и является простым и гибким средством для разработки высокопроизводительных сетевых приложений.",
      url: require("@/assets/icons/node.png"),
    },
    {
      name: "nest",
      descr:
        "Nest.js - это фреймворк для Node.js, который предлагает модульный и гибкий подход к разработке приложений на основе сервера. Он основан на TypeScript и вдохновлен паттернами проектирования, используемыми в Angular.",
      url: require("@/assets/icons/nest.png"),
    },
    {
      name: "mysql",
      descr:
        "MySQL - это одна из самых популярных открытых систем управления реляционными базами данных (RDBMS). Она позволяет хранить, обрабатывать и извлекать данные из базы данных, используя язык запросов SQL.",
      url: require("@/assets/icons/mysql.png"),
    },
    {
      name: "graph",
      descr:
        "GraphQL - это язык запросов и описания данных для API, разработанный компанией Facebook. Он предлагает более эффективный, эластичный и удобный способ управления запросами к API, чем обычные REST API.",
      url: require("@/assets/icons/graph.png"),
    },
  ],
};
